IDEA Open Model
TypeOfCalculationDeflection Enumeration
Compatible with IDEA StatiCa 20.1
 Define type of support conditions
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum TypeOfCalculationDeflection
Public Enumeration TypeOfCalculationDeflection
Members
Member name | Value | Description
CheckSlenderness | 0 |  check slenderness calculation, if rules are full filed no other calculation is done
CheckSlendernessContinueDirectCalculation | 1 |  if check of slenderness is not ok then, directly calculation of deflection is done
DirectCalculation | 2 |  check of slenderness is not taken into account, directly calculation of deflection is done
BothOfThem | 3 |  both calculation is done, it is for comparative results
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace